In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import sklearn

In [2]:
import pandas as pd
data = pd.read_table("https://raw.githubusercontent.com/justmarkham/pandas-videos/master/data/u.user")
data

          1|24|M|technician|85711
0              2|53|F|other|94043
1             3|23|M|writer|32067
2         4|24|M|technician|43537
3              5|33|F|other|15213
4          6|42|M|executive|98101
..                            ...
937        939|26|F|student|33319
938  940|32|M|administrator|02215
939        941|20|M|student|97229
940      942|48|F|librarian|78209
941        943|22|M|student|77841

[942 rows x 1 columns]

In [3]:
data = pd.read_table("http://bit.ly/movieusers",sep="|")
data.head(2)

   1  24  M technician  85711
0  2  53  F      other  94043
1  3  23  M     writer  32067

In [4]:
data = pd.read_table("http://bit.ly/movieusers",sep="|",header=None)
data.head(2)

   0   1  2           3      4
0  1  24  M  technician  85711
1  2  53  F       other  94043

### Handling the missing values

In [5]:
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017       -99999          7  Sunny
2  1/3/2017           28     -99999   Snow
3  1/4/2017       -99999          7      0
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [6]:
df.day.dtype

dtype('O')

In [7]:
type(df.day[0])

str

In [8]:
#returns frequency of column names
df['temperature'].value_counts() #mode

-99999    2
 32       2
 31       1
 28       1
 34       1
Name: temperature, dtype: int64

In [9]:
df[df.duplicated()]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [10]:
#checking for duplicates specific temperature column
df[df['temperature'].duplicated()]

        day  temperature  windspeed event
3  1/4/2017       -99999          7     0
4  1/5/2017           32     -99999  Rain

In [11]:
df[df['event'].duplicated()]

        day  temperature  windspeed  event
4  1/5/2017           32     -99999   Rain
5  1/6/2017           31          2  Sunny
6  1/6/2017           34          5      0

In [12]:
df['event'].value_counts()

Rain     2
0        2
Sunny    2
Snow     1
Name: event, dtype: int64

In [13]:
df = pd.read_csv("https://raw.githubusercontent.com/Mounika-Kajjam/Datasets/master/weather_data.csv",parse_dates = ['day'])

In [14]:
df

         day  temperature  windspeed  event
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0

In [15]:
df.day.dtype

dtype('<M8[ns]')

In [16]:
type(df.day[0])

pandas._libs.tslibs.timestamps.Timestamp

In [17]:
new_df = df.replace({'temperature': -99999,'windspeed' : -99999,'event' : '0'},np.nan)
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0    NaN
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

### Imputation:Imputation is a process of substituting the missing values

In [18]:
new_df.isnull().sum()

day            0
temperature    2
windspeed      2
event          2
dtype: int64

In [19]:
#fillna() is a function which is used to fill missing values
data = new_df.fillna(0) # shift+tab 4times for documentation to be appeared in kernel
data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          0.0        7.0  Sunny
2 2017-01-03         28.0        0.0   Snow
3 2017-01-04          0.0        7.0      0
4 2017-01-05         32.0        0.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0

In [20]:
f_fill = new_df.fillna(method='ffill')
f_fill

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         28.0        7.0   Snow
4 2017-01-05         32.0        7.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0  Sunny

In [21]:
## bfill -- backfill
b_fill = new_df.fillna(method='bfill')
b_fill

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         28.0        7.0  Sunny
2 2017-01-03         28.0        7.0   Snow
3 2017-01-04         32.0        7.0   Rain
4 2017-01-05         32.0        2.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [22]:
new_df.mean()

temperature    31.4
windspeed       5.4
dtype: float64

In [23]:
mean_data = new_df.fillna(new_df.mean())
mean_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         31.4        7.0  Sunny
2 2017-01-03         28.0        5.4   Snow
3 2017-01-04         31.4        7.0    NaN
4 2017-01-05         32.0        5.4   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [24]:
new_df.median()

temperature    32.0
windspeed       6.0
dtype: float64

In [25]:
median_data = new_df.fillna(new_df.fillna(new_df.median()))
median_data

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02         32.0        7.0  Sunny
2 2017-01-03         28.0        6.0   Snow
3 2017-01-04         32.0        7.0    NaN
4 2017-01-05         32.0        6.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0    NaN

In [29]:
new_df.event.mode().iloc[1]

'Sunny'

In [31]:
new_df['event'] = new_df['event'].fillna(new_df.event.mode().iloc[0])
new_df

         day  temperature  windspeed  event
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0   Rain
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0   Rain

In [ ]:
Question 12:
Magic Square:
    22 12 18 87-->dd mm cc yy
    88 17 9 25-->yy+1 cc-1 mm-3 dd+3
    10 24 89 16-->mm-2 dd+2 yy+2 cc-2
    19 86 23 11-->cc+1 yy-1 dd+1 mm-1
    
    30 10 19 99
    100 18 7 33
    8 32 101 17
    20 98 31 9
    

                19  7   19  93
                94  18  4   22
                5   21  95  17
                20  92  20   6

In [33]:
import numpy as np
arr1 = np.array([[19,7,19,93],
               [94,18,4,22],
               [5,21,95,17],
               [20,92,20,6]])

In [39]:
#sum of corner elements is 138
arr1[0,0]+arr1[0,3]+arr1[3,0]+arr1[3,3]

138

In [41]:
print(arr1[0,0]+arr1[0,1]+arr1[1,0]+arr1[1,1])

s=0
for i in range(2):
    for j in range(2):
            s += arr1[i,j]
s

138

138

In [40]:
f=0
b=0
for i in range(4):
    for j in range(4):
        if i==j:
            f += arr1[i,j]
        if i+j ==3:
            b += arr1[i,j]
print(f)
print(b)

138
138

In [37]:
#sum of middle square is 138
s = 0
for i in range(1,3):
    for j in range(1,3):
            s += arr1[i,j]
s

138

In [34]:
#sum of columns is 138
arr1.sum(axis=1)

array([138, 138, 138, 138])

In [35]:
#sum of rows is 138
arr1.sum(axis=0)

array([138, 138, 138, 138])

In [36]:
#forward diagonal sum
arr1.trace(axis1=1,axis2=0)

138